#define 寄 std::cout
#define 寄寄 << "🟥"
#define 寄寄寄 <<
#define 寄寄寄寄 "🟦"
#define 寄寄寄寄寄 std::endl;
#define 寄寄寄寄寄寄寄 return
#define 寄寄寄寄寄寄寄寄 0;
#define 寄寄寄寄寄寄寄寄寄 int
#define 寄寄寄寄寄寄寄寄寄寄 main()
#define 寄寄寄寄寄寄寄寄寄寄寄 {
#define 寄寄寄寄寄寄寄寄寄寄寄寄 }
#define 寄寄寄寄寄寄寄寄寄寄寄寄寄 <iostream>

#include 寄寄寄寄寄寄寄寄寄寄寄寄寄

寄寄寄寄寄寄寄寄寄 寄寄寄寄寄寄寄寄寄寄 寄寄寄寄寄寄寄寄寄寄寄
    寄 寄寄 寄寄 寄寄 寄寄 寄寄 寄寄 寄寄寄 寄寄寄寄寄
    寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄寄
    寄 寄寄 寄寄 寄寄 寄寄 寄寄寄 寄寄寄寄寄
    寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄 寄寄寄 寄寄寄寄寄
    寄 寄寄 寄寄 寄寄寄 寄寄寄寄寄
    寄寄寄寄寄寄寄 寄寄寄寄寄寄寄寄
寄寄寄寄寄寄寄寄寄寄寄寄
